# Mac Setup Brewfile
# This file lists the software to be installed by Homebrew.
# Run `brew bundle` or `./setup.sh` to install everything listed here.

# No need to explicitly tap core/cask in modern Homebrew

# --- Command Line Tools (brew) ---
brew "bat"
brew "croc"
brew "curl"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "mas"
brew "shellcheck"
brew "tldr"
brew "tree"
brew "uv"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"

# --- Graphical Apps (cask) ---
cask "1password"
cask "antigravity-cli"
cask "antigravity"
cask "appcleaner"
cask "calibre"
cask "docker-desktop"
cask "elegoo-slicer"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "google-gemini"
cask "grandperspective"
cask "iterm2"
cask "mac-mouse-fix"
cask "minecraft"
cask "qlmarkdown"
cask "steam"
cask "syntax-highlight"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Note: Add `slack`, `discord`, or others as needed.

# --- Mac App Store Apps (mas) ---
# Ensure you are signed into the Mac App Store before running `brew bundle`
mas "1Password for Safari", id: 1569813296
mas "BetterSnapTool", id: 417375580
mas "iMovie", id: 408981434
mas "Mela", id: 1568924476
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "OneNote", id: 784801555
mas "Pixelmator Pro", id: 1289583905
mas "Wipr 2", id: 1662217862
mas "WireGuard", id: 1451685025
